In [1]:
import os
import pandas as pd
import numpy as np
from sqlalchemy import create_engine
from datetime import date, timedelta
from pandas.tseries.offsets import * 
import calendar

pd.options.display.max_rows = 30

engine = create_engine("mysql+pymysql://root:@localhost:3306/stock")
const = engine.connect()

data_path = "../data/"
csv_path = "\\Users\\User\\iCloudDrive\\"
one_path = "\\Users\\User\\OneDrive\\Documents\\Data\\"
osd_path = "\\Users\\User\\OneDrive\\Documents\\obsidian-git-sync\\Data\\"

today = date.today()
yesterday = today - timedelta(days=1)
today, yesterday

(datetime.date(2023, 6, 27), datetime.date(2023, 6, 26))

In [2]:
#today = date(2023, 4, 25)
yesterday = today - timedelta(days=1)
today, yesterday

(datetime.date(2023, 6, 27), datetime.date(2023, 6, 26))

In [3]:
# convert the timedelta object to a BusinessDay object
num_business_days = BDay(2)
yesterday = today - num_business_days
print(f'today: {today}')
to_mmdd = today.strftime('%m-%d')
print(f'Today in mm-dd format: {to_mmdd}')
print(f'yesterday: {yesterday}')

today: 2023-06-27
Today in mm-dd format: 06-27
yesterday: 2023-06-23 00:00:00

In [4]:
#yesterday = yesterday.date()
yesterday

Timestamp('2023-06-23 00:00:00')

In [5]:
sql = '''
SELECT period, name, volbuy AS shares
FROM buy
ORDER BY period, name'''
buy = pd.read_sql(sql, const)
buy['shares'] = buy['shares'].astype('int64')
buy

   period     name  shares
0       1    JASIF  130000
1       1      MCS   78000
2       1    PTTGC    6000
3       1      TMT   36000
4       2      ASK    4500
5       2      ASP   30000
6       2    BANPU   30000
7       2  CPNREIT   60000
8       2      DIF   32000
9       2   GVREIT   30000
10      2      NER   27000
11      2      ORI   45000
12      2      RCL   27000
13      2     SENA  105000
14      2      STA    5000
15      2    WHAIR   50000
16      2    WHART   30000
17      3      IVL    7200
18      3      JMT    6000
19      3      SCC     600
20      4       AH    1200
21      4      AWC    9000
22      4      BCH   15000
23      4       EA     400
24      4     ICHI    1500
25      4    JMART    9000
26      4      KCE   10000
27      4      KTC     900
28      4   SINGER    6000
29      4    SYNEX   15000

In [6]:
file_name = "buy-input.csv"
data_file = data_path + file_name
osd_file = osd_path + file_name
buy.to_csv(data_file, index=False)
buy.to_csv(osd_file, index=False)

In [7]:
sql = """
SELECT *
FROM price
LIMIT 1"""
prices = pd.read_sql(sql, const)
prices.dtypes

name      object
date      object
price    float64
maxp     float64
minp     float64
qty        int64
opnp     float64
dtype: object

### Call ruby ruby\find-change-fm-2-dates.rb

In [8]:
%pwd

'C:\\Users\\User\\OneDrive\\A7\\Daily'

In [9]:
os.chdir("C:\\users\\user\\onedrive\\a7")
%pwd

'C:\\users\\user\\onedrive\\a7'

In [10]:
!ruby ruby\\find-change-fm-2-dates.rb '2022-12-30' '2023-06-27'

    period       name     shares      date1      date2     price1     price2     change    %change     amount        spd
         1      JASIF     130000   22-12-30   23-06-27       8.05       7.10      -0.95     -11.80 -123,500.00        -19
         1        MCS      78000   22-12-30   23-06-27       8.95       6.45      -2.50     -27.93 -195,000.00        -50
         1      PTTGC       6000   22-12-30   23-06-27      47.25      36.25     -11.00     -23.28 -66,000.00        -44
         1        TMT      36000   22-12-30   23-06-27       7.80       7.30      -0.50      -6.41 -18,000.00        -10
         2        ASK       4500   22-12-30   23-06-27      35.50      24.60     -10.90     -30.70 -49,050.00        -46
         2        ASP      30000   22-12-30   23-06-27       2.98       2.78      -0.20      -6.71  -6,000.00        -10
         2      BANPU      30000   22-12-30   23-06-27      13.70       8.90      -4.80     -35.04 -144,000.00        -59
         2    CPNREIT      60000   22-12-30   23-06-27      19.50      11.40      -8.10     -41.54 -486,000.00        -81
         2        DIF      32000   22-12-30   23-06-27      13.20      10.70      -2.50     -18.94 -80,000.00        -25
         2     GVREIT      30000   22-12-30   23-06-27       9.10       8.35      -0.75      -8.24 -22,500.00        -15
         2        NER      27000   22-12-30   23-06-27       6.35       4.52      -1.83     -28.82 -49,410.00        -51
         2        ORI      45000   22-12-30   23-06-27      12.10      10.00      -2.10     -17.36 -94,500.00        -21
         2        RCL      27000   22-12-30   23-06-27      30.75      23.70      -7.05     -22.93 -190,350.00        -36
         2       SENA     105000   22-12-30   23-06-27       3.94       2.98      -0.96     -24.37 -100,800.00        -48
         2        STA       5000   22-12-30   23-06-27      21.10      16.80      -4.30     -20.38 -21,500.00        -43
         2      WHAIR      50000   22-12-30   23-06-27       7.45       7.15      -0.30      -4.03 -15,000.00         -6
         2      WHART      30000   22-12-30   23-06-27      10.70      10.40      -0.30      -2.80  -9,000.00         -3
         3        IVL       7200   22-12-30   23-06-27      40.75      32.50      -8.25     -20.25 -59,400.00        -33
         3        JMT       6000   22-12-30   23-06-27      69.00      34.75     -34.25     -49.64 -205,500.00       -137
         3        SCC        600   22-12-30   23-06-27     342.00     321.00     -21.00      -6.14 -12,600.00        -21
         4         AH       1200   22-12-30   23-06-27      29.75      32.25       2.50       8.40   3,000.00         10
         4        AWC       9000   22-12-30   23-06-27       6.30       4.76      -1.54     -24.44 -13,860.00        -38
         4        BCH      15000   22-12-30   23-06-27      20.50      17.00      -3.50     -17.07 -52,500.00        -35
         4         EA        400   22-12-30   23-06-27      97.00      52.75     -44.25     -45.62 -17,700.00       -177
         4       ICHI       1500   22-12-30   23-06-27      11.30      12.90       1.60      14.16   2,400.00         16
         4      JMART       9000   22-12-30   23-06-27      40.75      13.70     -27.05     -66.38 -243,450.00       -176
         4        KCE      10000   22-12-30   23-06-27      46.50      37.00      -9.50     -20.43 -95,000.00        -38
         4        KTC        900   22-12-30   23-06-27      59.00      49.75      -9.25     -15.68  -8,325.00        -37
         4     SINGER       6000   22-12-30   23-06-27      28.75       8.70     -20.05     -69.74 -120,300.00       -191
         4      SYNEX      15000   22-12-30   23-06-27      16.40      12.30      -4.10     -25.00 -61,500.00        -41

In [11]:
os.chdir("C:\\users\\user\\onedrive\\a7\\Daily")
%pwd

'C:\\users\\user\\onedrive\\a7\\Daily'

In [12]:
data_path = "../data/"
file_name   = 'prices-change.csv'
input_file = data_path + file_name
df = pd.read_csv(input_file, sep=',', index_col=None)
df.sample(5)

,period,name,shares,date1,date2,price1,price2,change,%change,amount,spd
10,2,NER,27000,2022-12-30,2023-06-27,6.35,4.52,-1.83,-28.82,-49410.0,-51
15,2,WHAIR,50000,2022-12-30,2023-06-27,7.45,7.15,-0.30,-4.03,-15000.0,-6
28,4,SINGER,6000,2022-12-30,2023-06-27,28.75,8.70,-20.05,-69.74,-120300.0,-191
18,3,JMT,6000,2022-12-30,2023-06-27,69.00,34.75,-34.25,-49.64,-205500.0,-137
29,4,SYNEX,15000,2022-12-30,2023-06-27,16.40,12.30,-4.10,-25.00,-61500.0,-41

In [13]:
df.sample(5).sort_values(['spd'],ascending=False)

,period,name,shares,date1,date2,price1,price2,change,%change,amount,spd
17,3,IVL,7200,2022-12-30,2023-06-27,40.75,32.50,-8.25,-20.25,-59400.0,-33
22,4,BCH,15000,2022-12-30,2023-06-27,20.50,17.00,-3.50,-17.07,-52500.0,-35
2,1,PTTGC,6000,2022-12-30,2023-06-27,47.25,36.25,-11.00,-23.28,-66000.0,-44
4,2,ASK,4500,2022-12-30,2023-06-27,35.50,24.60,-10.90,-30.70,-49050.0,-46
1,1,MCS,78000,2022-12-30,2023-06-27,8.95,6.45,-2.50,-27.93,-195000.0,-50

In [14]:
df.sample(5).sort_values(['spd'],ascending=True)

,period,name,shares,date1,date2,price1,price2,change,%change,amount,spd
25,4,JMART,9000,2022-12-30,2023-06-27,40.75,13.70,-27.05,-66.38,-243450.0,-176
18,3,JMT,6000,2022-12-30,2023-06-27,69.00,34.75,-34.25,-49.64,-205500.0,-137
13,2,SENA,105000,2022-12-30,2023-06-27,3.94,2.98,-0.96,-24.37,-100800.0,-48
2,1,PTTGC,6000,2022-12-30,2023-06-27,47.25,36.25,-11.00,-23.28,-66000.0,-44
24,4,ICHI,1500,2022-12-30,2023-06-27,11.30,12.90,1.60,14.16,2400.0,16

In [15]:
period = df.groupby("period")
period.sum()

        shares  price1  price2  change  %change     amount  spd
period
1       250000   72.05   57.10  -14.95   -69.42  -402500.0 -123
2       475500  186.37  142.28  -44.09  -261.86 -1268110.0 -444
3        13800  451.75  388.25  -63.50   -76.03  -277500.0 -191
4        68000  356.25  241.11 -115.14  -261.80  -607235.0 -707

In [16]:
df.groupby('period').agg(
      ttl_shr = pd.NamedAgg('shares', 'sum'),
      avr_p1  = pd.NamedAgg('price1','mean'),
      avr_p2  = pd.NamedAgg('price2','mean'),  
      avr_chg = pd.NamedAgg('change','mean'),
      avr_spd = pd.NamedAgg('spd','mean'),
      ttl_amt = pd.NamedAgg('amount', 'sum')
   )

        ttl_shr      avr_p1      avr_p2    avr_chg    avr_spd    ttl_amt
period
1        250000   18.012500   14.275000  -3.737500 -30.750000  -402500.0
2        475500   14.336154   10.944615  -3.391538 -34.153846 -1268110.0
3         13800  150.583333  129.416667 -21.166667 -63.666667  -277500.0
4         68000   35.625000   24.111000 -11.514000 -70.700000  -607235.0

In [17]:
pl = df.amount.sum()
pl

-2555345.0

In [18]:
prev_pl = -2_597_685
diff = pl - prev_pl
diff

42340.0